Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24h/h/p24HJ128GP306A.h
#define _DMA5REQ_IRQSEL1_POSITION                0x00000001
#define _DMA5REQ_IRQSEL1_MASK                    0x00000002
#define _DMA5REQ_IRQSEL1_LENGTH                  0x00000001

#define _DMA5REQ_IRQSEL2_POSITION                0x00000002
#define _DMA5REQ_IRQSEL2_MASK                    0x00000004
#define _DMA5REQ_IRQSEL2_LENGTH                  0x00000001

#define _DMA5REQ_IRQSEL3_POSITION                0x00000003
#define _DMA5REQ_IRQSEL3_MASK                    0x00000008
#define _DMA5REQ_IRQSEL3_LENGTH                  0x00000001

#define _DMA5REQ_IRQSEL4_POSITION                0x00000004
#define _DMA5REQ_IRQSEL4_MASK                    0x00000010
#define _DMA5REQ_IRQSEL4_LENGTH                  0x00000001

#define _DMA5REQ_IRQSEL5_POSITION                0x00000005
#define _DMA5REQ_IRQSEL5_MASK                    0x00000020
#define _DMA5REQ_IRQSEL5_LENGTH                  0x00000001

#define _DMA5REQ_IRQSEL6_POSITION                0x00000006
#define _DMA5REQ_IRQSEL6_MASK                    0x00000040
#define _DMA5REQ_IRQSEL6_LENGTH                  0x00000001

#define _DMA6CON_MODE_POSITION                   0x00000000
#define _DMA6CON_MODE_MASK                       0x00000003
#define _DMA6CON_MODE_LENGTH                     0x00000002

#define _DMA6CON_AMODE_POSITION                  0x00000004
#define _DMA6CON_AMODE_MASK                      0x00000030
#define _DMA6CON_AMODE_LENGTH                    0x00000002

#define _DMA6CON_NULLW_POSITION                  0x0000000B
#define _DMA6CON_NULLW_MASK                      0x00000800
#define _DMA6CON_NULLW_LENGTH                    0x00000001

#define _DMA6CON_HALF_POSITION                   0x0000000C
#define _DMA6CON_HALF_MASK                       0x00001000
#define _DMA6CON_HALF_LENGTH                     0x00000001

#define _DMA6CON_DIR_POSITION                    0x0000000D
#define _DMA6CON_DIR_MASK                        0x00002000
#define _DMA6CON_DIR_LENGTH                      0x00000001

#define _DMA6CON_SIZE_POSITION                   0x0000000E
#define _DMA6CON_SIZE_MASK                       0x00004000
#define _DMA6CON_SIZE_LENGTH                     0x00000001

#define _DMA6CON_CHEN_POSITION                   0x0000000F
#define _DMA6CON_CHEN_MASK                       0x00008000
#define _DMA6CON_CHEN_LENGTH                     0x00000001

#define _DMA6CON_MODE0_POSITION                  0x00000000
#define _DMA6CON_MODE0_MASK                      0x00000001
#define _DMA6CON_MODE0_LENGTH                    0x00000001

#define _DMA6CON_MODE1_POSITION                  0x00000001
#define _DMA6CON_MODE1_MASK                      0x00000002
#define _DMA6CON_MODE1_LENGTH                    0x00000001

#define _DMA6CON_AMODE0_POSITION                 0x00000004
#define _DMA6CON_AMODE0_MASK                     0x00000010
#define _DMA6CON_AMODE0_LENGTH                   0x00000001

#define _DMA6CON_AMODE1_POSITION                 0x00000005
#define _DMA6CON_AMODE1_MASK                     0x00000020
#define _DMA6CON_AMODE1_LENGTH                   0x00000001

#define _DMA6REQ_IRQSEL_POSITION                 0x00000000
#define _DMA6REQ_IRQSEL_MASK                     0x0000007F
#define _DMA6REQ_IRQSEL_LENGTH                   0x00000007

#define _DMA6REQ_FORCE_POSITION                  0x0000000F
#define _DMA6REQ_FORCE_MASK                      0x00008000
#define _DMA6REQ_FORCE_LENGTH                    0x00000001

#define _DMA6REQ_IRQSEL0_POSITION                0x00000000
#define _DMA6REQ_IRQSEL0_MASK                    0x00000001
#define _DMA6REQ_IRQSEL0_LENGTH                  0x00000001

#define _DMA6REQ_IRQSEL1_POSITION                0x00000001
#define _DMA6REQ_IRQSEL1_MASK                    0x00000002
#define _DMA6REQ_IRQSEL1_LENGTH                  0x00000001

#define _DMA6REQ_IRQSEL2_POSITION                0x00000002
#define _DMA6REQ_IRQSEL2_MASK                    0x00000004
#define _DMA6REQ_IRQSEL2_LENGTH                  0x00000001

#define _DMA6REQ_IRQSEL3_POSITION                0x00000003
#define _DMA6REQ_IRQSEL3_MASK                    0x00000008
#define _DMA6REQ_IRQSEL3_LENGTH                  0x00000001

#define _DMA6REQ_IRQSEL4_POSITION                0x00000004
#define _DMA6REQ_IRQSEL4_MASK                    0x00000010
#define _DMA6REQ_IRQSEL4_LENGTH                  0x00000001

#define _DMA6REQ_IRQSEL5_POSITION                0x00000005
#define _DMA6REQ_IRQSEL5_MASK                    0x00000020
#define _DMA6REQ_IRQSEL5_LENGTH                  0x00000001

#define _DMA6REQ_IRQSEL6_POSITION                0x00000006
#define _DMA6REQ_IRQSEL6_MASK                    0x00000040
#define _DMA6REQ_IRQSEL6_LENGTH                  0x00000001

#define _DMA7CON_MODE_POSITION                   0x00000000
#define _DMA7CON_MODE_MASK                       0x00000003
#define _DMA7CON_MODE_LENGTH                     0x00000002

#define _DMA7CON_AMODE_POSITION                  0x00000004
#define _DMA7CON_AMODE_MASK                      0x00000030
#define _DMA7CON_AMODE_LENGTH                    0x00000002

#define _DMA7CON_NULLW_POSITION                  0x0000000B
#define _DMA7CON_NULLW_MASK                      0x00000800
#define _DMA7CON_NULLW_LENGTH                    0x00000001

#define _DMA7CON_HALF_POSITION                   0x0000000C
#define _DMA7CON_HALF_MASK                       0x00001000
#define _DMA7CON_HALF_LENGTH                     0x00000001

#define _DMA7CON_DIR_POSITION                    0x0000000D
#define _DMA7CON_DIR_MASK                        0x00002000
#define _DMA7CON_DIR_LENGTH                      0x00000001

#define _DMA7CON_SIZE_POSITION                   0x0000000E
#define _DMA7CON_SIZE_MASK                       0x00004000
#define _DMA7CON_SIZE_LENGTH                     0x00000001

#define _DMA7CON_CHEN_POSITION                   0x0000000F
#define _DMA7CON_CHEN_MASK                       0x00008000
#define _DMA7CON_CHEN_LENGTH                     0x00000001

#define _DMA7CON_MODE0_POSITION                  0x00000000
#define _DMA7CON_MODE0_MASK                      0x00000001
#define _DMA7CON_MODE0_LENGTH                    0x00000001

